import os
from VCPlayBot.config import SOURCE_CODE,ASSISTANT_NAME,PROJECT_NAME,SUPPORT_GROUP,UPDATES_CHANNEL
class Messages():
      START_MSG = "**سڵاوو 👋 [{}](tg://user?id={})!**\n\n🤖 من بۆتی پەخشکردنی گۆرانیم لە کەناڵ و گرووپەکانی تیلیگرام .\n\n✅ بۆ زانیاری زیاتر /help دابگرا."
      HELP_MSG = [
        ".",
f"""
**سڵاوو 👋 بەخێربیت بۆ پڕۆژەی {PROJECT_NAME}

⚪️ {PROJECT_NAME} دەتوانێت لە گرووپ و کەناڵ لەچاتی دەنگی گۆرانی پەخشبکا

⚪️ یارمەتی دەر >> @{ASSISTANT_NAME}\n\nزیادی گرووپت بکە بۆ ئەوەی بتوانێتن لە چاتی دەنگی پەخشبکا**
""",

f"""
**ڕێکخستن**

1) بۆت بکە بەڕێوەبەر لە (گرووپ یان کەناڵت)
2) ئیجا چاتی دەنگی بکەوە
3) بنوسە /play [ناووی گۆرانی] بەڵام سەرەتا بۆت بکە ئەدمین
*) ئەگەر userbot پەیوەندی کرد بە گرووپ چاتەکەت  لە چاتی دەنگی، ئەگەر @{ASSISTANT_NAME} زیاد نەکرا بۆ گروپەکەت و دووبارە هەوڵ بدەوە

**بۆ کەناڵ **
1) بمکە ئەدمین لەکەناڵەکەت
2) دواتر  /userbotjoinchannel بنێرە لەگرووپەکەی کە بەکەناڵەکەت بەستوتەوە 
3) ئیجا دواتر لەگرووپەکە فەرمان بکە پێم
**Commands**

**=>> فەرمانەکانی پێ کردنی گۆرانی 🎧**

- /play: بۆ داواکردنی گۆرانی
- /play [لینکی یوتوب] :  لینکی یوتوب بنێە 
- /play [لە وەڵامدانەوەی گۆرانی]: لە ڕێگەی ڕیپڵەی کردنی گۆرانی 
- /dplay: بۆ پێکردنی گۆرانی لە deezer
- /splay: بۆ پێکردنی گۆرانی لە jio saavn
- /ytplay: بۆ داگرتنی گۆرانی لە یوتوب Youtube Music

**=>> پەخشکردن ⏯**

- /player:  کردنەوەی لیستی ڕێکبەندەکانی لێدەر
- /skip: تێپەڕاندنی گۆرانی
- /pause: ڕاگرتنی گۆرانی
- /resume: پێکردنەوەی گۆرانی
- /end: راگرتنی گۆرانی و لە چاتی دەنگی دەرچۆن
- /current: بینینی لیستی گۆرانیەکان بۆ پخشکردن
- /playlist: ببینی لیستی پەشخکردن

*لێدەر cmd و هەموو cmds ی تر جگە لە /play ، /current ئێستا و /playlist تەنیا بۆ سەرپەرشتیارانی گروپەکەیە .
""",
        
f"""
**=>> پەخشکردنی گۆرانی لە کەناڵ 🛠**

⚪️ کەناڵەکە بە گرووپ بەسترابێتەوە تکایەیە دڵنیابیت لێی :

- /cplay [ناووی گۆرانی] - پەخشکردنی گۆرانی داواکراوو
- /cdplay [ناووی گۆرانی] - پەخشکردنی گۆرانی لە deezer
- /csplay [ناووی گۆرانی] - پەخشکردنی گۆرانی لە jio saavn
- /cplaylist - بینینی لیستی پەخشکراوەکان
- /cccurrent - بینینی لیستی پەخشکردن
- /cplayer - بۆ کردنەوەی ڕێبەندەکانی پەخشکردن
- /cpause - بۆ ڕاگرتنی گۆرانی
- /cresume - بۆ پەخشکردنەوەی گۆرانی
- /cskip - بۆ تێپەڕاندنی گۆرانی
- /cend - بۆ ڕاگرتنی گۆرانی بەیەکجاری
- /userbotjoinchannel - بۆ بانگەشت کردنی یارمەتی دەر 

هەروەها کەناڵەکە دەتوانرێت بەکاربهێنرێت لە جیاتی سی ( /cplay = /channelplay )

⚪️ ئەگەر حەزت لە یاریکردن نییە لە گرووپی لینککراو:

1) ناسنامەی کەناڵەکەت دەست بکە.
2 ) کۆمەڵەیەک بە تیتیلێ دروست بکە : کەناڵ موزیک : your_channel_id
3) بۆت زیاد بکە وەک بەڕێوەبەری کەناڵ لەگەڵ پرم
4) @{ASSISTANT_NAME} زیاد بکە سەر کەناڵەکە وەک بەڕێوەبەر.
5) بە سادەیی فەرمانەکان بنێرە لە گروپەکەت.
""",

f"""
**=>> ڕێبەندنی ڕێکخستن 🧑‍🔧**

- /musicplayer [on/off]: ڕاگرتن و کردنەوەی پەخشکردن
- /admincache: بۆ هەڵگرتنی بەڕێوەبەرەکان و نو کردنەوە
- /userbotjoin: بۆ بانگێشت کردنی @{ASSISTANT_NAME} بۆ چاتەکەت

**=>> فەرمانەکانی بەڕێوەبەری بۆت ⚔️**

 - /userbotleaveall - بۆ دەرکردنی یارمەتدی دەر لەهەموو گرووپێک
 - /gcast <لەوەڵامدانەوە> - بۆ وەڵام دانەوەی هەموو چاتەکان
 - /pmpermit [on/off] - ڕاگرتن/چاڵاکردن تایبەت
*بەڕێوەبەری بۆت دەتوانن هەر فەرمانێک جێبەجێ بکەن لە هەر گروپێکدا

"""
      ]
